# 滴水三期中级笔记

看了视频没怎么理清楚,所以写笔记理一下思路.可能以后玩会了就不写笔记了.

有2个原则:

1.只写我的理解,没理解到的不写.

2.先写通用的,后面要用到了再写特殊的.

------

环境配置:

 [双机调试_windbg.pdf](双机调试_windbg.pdf) 

## 1.保护模式

x86 CPU的3个模式:实模式,保护模式和虚拟8086模式.

建议先参考王爽的汇编语言,我3年前的笔记https://note.youdao.com/s/y3jcBKz.

------

由于历史遗留原因,8086所采用的20位地址总线,寻址地址达到了2的20次方,即1MB.但是由于采用的是16位架构,其他通用寄存器只能达到2的16次方寻址,即64KB.所以采用了段加偏移的方式来寻址,即段地址x16+偏移地址=物理地址.这一点在x86保护模式下也采用了,只不过32位的通用寄存器可以直接寻址所有地址,段寄存器的主要作用变为了权限控制,比如代码段可读可执行不可写,数据段可读可写不可执行.

在x86架构下的段寄存器有96位,但是只有16位可以直接改变.剩下的80位不能直接改变.

结构如下:

```c++
class SegMent
{
public:
	WORD Selector;		//段选择子

private:
	WORD Attributes;	//权限
	DWORD Base;			//基址
	DWORD Limit;		//段长度

};
```

由于不能直接改变段寄存器,所以我们只能间接的通过一张表来进行更改段寄存器,即全局描述符表(GPT,Global Descriptor Table),还有另外一张表,局部描述符表(LPT,Local Descriptor Table),Windows并没有用上.

```assembly
mov ax,es	//复制Selector到ax.
mov es,ax	//通过Selector查找GPT,然后加载GTPT对于的表到es.
//除了mov指令还有LES,LSS,LDS,LFS,LGS等指令可以修改段寄存器,还没有学到,先不讨论.
```

GPT表的位置,大小存储在gdtr(48位)寄存器中.

windbg:

```
kd> r gdtr
gdtr=8003f000
kd> r gdtl
gdtl=000003ff
kd> dq 8003f000 l10
ReadVirtual: 8003f000 not properly sign extended
8003f000  00000000`00000000 00cf9b00`0000ffff
8003f010  00cf9300`0000ffff 00cffb00`0000ffff
8003f020  00cff300`0000ffff 80008b04`200020ab
8003f030  ffc093df`f0000001 0040f300`00000fff
8003f040  0000f200`0400ffff 00000000`00000000
8003f050  80008955`27000068 80008955`27680068
8003f060  00009302`2f40ffff 0000920b`80003fff
8003f070  ff0092ff`700003ff 80009a40`0000ffff
```

------

段选择子:

16位,指向了定义该段的段描述符. 


	{//新的函数地址再加上相对加载地址，得到现在的ssdt函数地址
		pNewSSDT->ServiceTableBase[uIndex] += uNewKernelInc;
	}
	DbgPrint("pNewSSDT:%p\n", pNewSSDT);
	DbgBreakPoint();
}

void PageProtectOn()
{
	__asm {//恢复内存保护  
		mov  eax, cr0
		or eax, 10000h
		mov  cr0, eax
		sti
	}
}
void PageProtectOff()
{
	__asm {//去掉内存保护
		cli
		mov  eax, cr0
		and eax, not 10000h
		mov  cr0, eax
	}
}

void HookKiFastCallEntry()
{
	ULONG KiFastCallEntryAdder;
	ULONG KiFastCallEntryHookAdder;
	UCHAR jmpbuffer[5] = { 0 };
	ULONG i;
	_asm
	{
		pushad
		mov ecx, 0x176;
		rdmsr
		mov KiFastCallEntryAdder, eax
		popad
	}
	DbgPrint("KiFastCallEntryAdder:%x\n", KiFastCallEntryAdder);
	for (i = 0; i < 1000; i++)
	{
		if (*(UCHAR*)(KiFastCallEntryAdder + i + 0) == 0x2B &&
			*(UCHAR*)(KiFastCallEntryAdder + i + 1) == 0xE1 &&
			*(UCHAR*)(KiFastCallEntryAdder + i + 2) == 0xC1 &&
			*(UCHAR*)(KiFastCallEntryAdder + i + 3) == 0xE9 &&
			*(UCHAR*)(KiFastCallEntryAdder + i + 4) == 0x02)
		{
			KiFastCallEntryHookAdder = KiFastCallEntryAdder + i;
			break;
		}
	}
	if (KiFastCallEntryHookAdder == NULL)
	{
		DbgPrint("KiFastCallEntryHookAdder没找到.\n");
	}
	JmpRet = KiFastCallEntryHookAdder + 5;
	jmpbuffer[0] = 0xE8;
	*(DWORD32*)&jmpbuffer[1] = (DWORD32)((DWORD32)MyKiFastCallEntry - KiFastCallEntryHookAdder - 5);
	PageProtectOff();
	RtlCopyMemory((PVOID)KiFastCallEntryHookAdder, jmpbuffer, 5);
	PageProtectOn();
}

__declspec(naked) void MyKiFastCallEntry()
{
	__asm
	{
		pushad
		pushfd
		push	ebx
		push	eax
		push	edi
		call	DisPlay
		//再返回前修改堆栈里的数据
		mov[esp + 0x14], eax
		popfd
		popad
		//恢复以前的代码，以便内核正常运行
		sub esp, ecx
		shr ecx, 2
		jmp JmpRet
	}
}

ULONG DisPlay(ULONG ServiceTableBase, ULONG FuncIndex, ULONG OrigFuncAddress)
{
	DbgPrint("ServiceTableBase:%x, FuncIndex:%x, OrigFuncAddress:%x.\n", ServiceTableBase, FuncIndex, OrigFuncAddress);
	return OrigFuncAddress;
}


void UnloadDriver(PDRIVER_OBJECT driver) {

	ExFreePool(pVirtualPointerTmp);
	DbgPrint("驱动停止了.\n");
}
```

![image-20230411114451729](./%E6%BB%B4%E6%B0%B4%E4%B8%89%E6%9C%9F%E4%B8%AD%E7%BA%A7%E7%AC%94%E8%AE%B0.assets/image-20230411114451729.png)

需要切换到ntkrnlpa.exe(29912分页),SSDT能正常用,但是调用里面函数就崩,Hook KiFastCallEntry成功.

![image-20230411114638136](./%E6%BB%B4%E6%B0%B4%E4%B8%89%E6%9C%9F%E4%B8%AD%E7%BA%A7%E7%AC%94%E8%AE%B0.assets/image-20230411114638136.png)

IAT表没修复?

## 3.系统调用

不说废话了,直接分析内核.

ReadProcessMemory

kernel32.dll

```assembly
mov     edi, edi
push    ebp
mov     ebp, esp
lea     eax, [ebp+nSize]
push    eax             ; NumberOfBytesRead
push    [ebp+nSize]     ; NumberOfBytesToRead
push    [ebp+lpBuffer]  ; Buffer
push    [ebp+lpBaseAddress] ; BaseAddress
push    [ebp+hProcess]  ; ProcessHandle
call    ds:__imp__NtReadVirtualMemory@20 ; NtReadVirtualMemory(x,x,x,x,x)	//调用了ntdll的NtReadVirtualMemory函数,跟过去.
```

ntdll.dll

```assembly
mov     eax, 0BAh       ; NtReadVirtualMemory	//系统服务号
mov     edx, 7FFE0300h
call    dword ptr [edx]	;ff call,这里涉及到了一个结构体.
retn    14h
```

_KUSER_SHARED_DATA

```
kd> dt _KUSER_SHARED_DATA
nt!_KUSER_SHARED_DATA
   +0x000 TickCountLow     : Uint4B
   +0x004 TickCountMultiplier : Uint4B
   +0x008 InterruptTime    : _KSYSTEM_TIME
   +0x014 SystemTime       : _KSYSTEM_TIME
   +0x020 TimeZoneBias     : _KSYSTEM_TIME
   +0x02c ImageNumberLow   : Uint2B
   +0x02e ImageNumberHigh  : Uint2B
   +0x030 NtSystemRoot     : [260] Uint2B
   +0x238 MaxStackTraceDepth : Uint4B
   +0x23c CryptoExponent   : Uint4B
   +0x240 TimeZoneId       : Uint4B
   +0x244 Reserved2        : [8] Uint4B
   +0x264 NtProductType    : _NT_PRODUCT_TYPE
   +0x268 ProductTypeIsValid : UChar
   +0x26c NtMajorVersion   : Uint4B
   +0x270 NtMinorVersion   : Uint4B
   +0x274 ProcessorFeatures : [64] UChar
   +0x2b4 Reserved1        : Uint4B
   +0x2b8 Reserved3        : Uint4B
   +0x2bc TimeSlip         : Uint4B
   +0x2c0 AlternativeArchitecture : _ALTERNATIVE_ARCHITECTURE_TYPE
   +0x2c8 SystemExpirationDate : _LARGE_INTEGER
   +0x2d0 SuiteMask        : Uint4B
   +0x2d4 KdDebuggerEnabled : UChar
   +0x2d5 NXSupportPolicy  : UChar
   +0x2d8 ActiveConsoleId  : Uint4B
   +0x2dc DismountCount    : Uint4B
   +0x2e0 ComPlusPackage   : Uint4B
   +0x2e4 LastSystemRITEventTickCount : Uint4B
   +0x2e8 NumberOfPhysicalPages : Uint4B
   +0x2ec SafeBootMode     : UChar
   +0x2f0 TraceLogging     : Uint4B
   +0x2f8 TestRetInstruction : Uint8B
   +0x300 SystemCall       : Uint4B	//就是ff call了这个地方
   +0x304 SystemCallReturn : Uint4B
   +0x308 SystemCallPad    : [3] Uint8B
   +0x320 TickCount        : _KSYSTEM_TIME
   +0x320 TickCountQuad    : Uint8B
   +0x330 Cookie           : Uint4B
```

SystemCall是一个指针,指向的地址的代码可能会不一样,具体是cpu是否支持快速调用决定的,操作系统在开机的时候会初始化这个地址的代码.

分为快速系统调用和中断门,本质都是提权,从ring3进ring0.提权的本质就是替换寄存器的值,这里根据替换的方式分为了上面2种.

```
kd> .process 89f2b420
ReadVirtual: 89f2b438 not properly sign extended
Implicit process is now 89f2b420
WARNING: .cache forcedecodeuser is not enabled
kd> dd 7FFE0300h
7ffe0300  7c92e4f0 7c92e4f4 00000000 00000000
7ffe0310  00000000 00000000 00000000 00000000
7ffe0320  00000000 00000000 00000000 00000000
7ffe0330  f7619a65 00000000 00000000 00000000
7ffe0340  00000000 00000000 00000000 00000000
7ffe0350  00000000 00000000 00000000 00000000
7ffe0360  00000000 00000000 00000000 00000000
7ffe0370  00000000 00000000 00000000 00000000
kd> u 7c92e4f0
7c92e4f0 8bd4            mov     edx,esp
7c92e4f2 0f34            sysenter
7c92e4f4 c3              ret
```

把esp放到了edx里面,然后执行了sysenter,快速系统调用提权.顾名思义,快速系统调用把要用到的cs ss eip esp的值存放到了msr这个寄存器里面,之前在获取KiFastCallEntry地址的时候用过.

```assembly
_asm
	{
		pushad
		mov ecx, 0x176;	//这里的176就是EIP0将要获取到的值,即KiFastCallEntry的入口点.
		rdmsr
		mov KiFastCallEntryAdder, eax
		popad
	}
```

| **MSR**           | **地址** |
| ----------------- | -------- |
| IA32_SYSENTER_CS  | 174H     |
| IA32_SYSENTER_ESP | 175H     |
| IA32_SYSENTER_EIP | 176H     |

```
kd> rdmsr 174
msr[174] = 00000000`00000008
kd> rdmsr 175
msr[175] = 00000000`ba4d0000
kd> rdmsr 176
msr[176] = 00000000`805426e0	//KiFastCallEntry的入口地址
kd> u KiFastCallEntry
nt!KiFastCallEntry:
805426e0 b923000000      mov     ecx,23h	//现在已经进ring0了
805426e5 6a30            push    30h
805426e7 0fa1            pop     fs
805426e9 8ed9            mov     ds,cx
805426eb 8ec1            mov     es,cx
805426ed 648b0d40000000  mov     ecx,dword ptr fs:[40h]
805426f4 8b6104          mov     esp,dword ptr [ecx+4]
805426f7 6a23            push    23h
```

OK,在ring3快速系统调用提权使用的函数是ntdll.dll!KiFastSystemCall(),中断门提权使用的函数是ntdll.dll!KiIntSystemCall().

ntdll.dll!KiFastSystemCall()

```assembly
mov     edx, esp
sysenter
```

ntdll.dll!KiIntSystemCall()

```assembly
lea     edx, [esp+arg_4]
int     2Eh             ; DOS 2+ internal - EXECUTE COMMAND
                        ; DS:SI -> counted CR-terminated command string
retn
```

我们先从最基础的中断门提权开始分析.

```assembly
arg_4= byte ptr  8

lea     edx, [esp+arg_4];这里edx获取了之前ReadProcessMemory传递的堆栈,eax里面保存了系统服务号.
int     2Eh             ; DOS 2+ internal - EXECUTE COMMAND
                        ; DS:SI -> counted CR-terminated command string
```

int 2e,OK,去看一下IDT表

```
kd> dq 8003f400+2e*8
ReadVirtual: 8003f570 not properly sign extended
8003f570  8054ee00`00082611 80548e00`0008590c
8003f580  80548e00`00081cd0 80548e00`00081cda
8003f590  80548e00`00081ce4 80548e00`00081cee
8003f5a0  80548e00`00081cf8 80548e00`00081d02
8003f5b0  80548e00`00081d0c 806e8e00`00087864
8003f5c0  80548e00`00081d20 80548e00`00081d2a
8003f5d0  80548e00`00081d34 80548e00`00081d3e
8003f5e0  80548e00`00081d48 806e8e00`00088e2c
```

拆分一下8054ee00`00082611,cs为0008,eip为80542611,ss和esp从tss获取,跟到80542611.

```
kd> u 80542611
ReadVirtual: 80542611 not properly sign extended
80542611 6a00            push    0
80542613 55              push    ebp
80542614 53              push    ebx
80542615 56              push    esi
80542616 57              push    edi
80542617 0fa0            push    fs
80542619 bb30000000      mov     ebx,30h
8054261e 668ee3          mov     fs,bx
kd> u KiSystemService
nt!KiSystemService:
80542611 6a00            push    0
80542613 55              push    ebp
80542614 53              push    ebx
80542615 56              push    esi
80542616 57              push    edi
80542617 0fa0            push    fs
80542619 bb30000000      mov     ebx,30h
8054261e 668ee3          mov     fs,bx
```

我的windbg有点问题,其实这个地址就是KiSystemService这个函数,现在已经进入到ring0了,所以现在应该用ida分析ntoskrnl.exe了

ntoskrnl.exe

KiSystemService()

```assembly
; int __usercall KiSystemService@<eax>(int@<edx>, int@<ebx>, int@<ebp>, int@<edi>, int@<esi>, char)
_KiSystemService proc near

arg_0= dword ptr  4

push    0	;//这里涉及到了_ktrap_Frame这个结构体.
push    ebp
push    ebx
push    esi
push    edi	
push    fs	;//保存一下寄存器的值
mov     ebx, 30h ; '0'
mov     fs, ebx	;//fs = 00110 0 00,段选择子为5,加载段选择子,指向_KPCR结构体
push    large dword ptr fs:0	;//_KPCR(+0x000 NtTib:_NT_TIB)->_NT_TIB(+0x000 ExceptionList:Ptr32 _EXCEPTION_REGISTRATION_RECORD),保存ExceptionList
mov     large dword ptr fs:0, 0FFFFFFFFh	;设置ExceptionList为-1
mov     esi, large fs:124h	;//esi指向_KPRCB.CurrentThread,当前CPU所执行线程的_ETHREAD
push    dword ptr [esi+140h]	;//+0x140 PreviousMode:Char,先前模式入栈,PreviousMode=0表示从0环调用过来,PreviousMode=1表示从3环调用过来
sub     esp, 48h	;//提升栈顶,现在esp指向_ktrap_Frame的第一个成员(+0x000 DbgEbp:Uint4B)
mov     ebx, [esp+68h+arg_0]	;//esp+68h+4,ebx=cs3
and     ebx, 1	;//001B&0001,判断之前的权限是0环还是3环,现在ebx=1
mov     [esi+140h], bl	;//设置PreviousMode为1
mov     ebp, esp	;//提升ebp,现在ebp指向_ktrap_Frame的第一个成员(+0x000 DbgEbp:Uint4B)
mov     ebx, [esi+134h]	;//(+0x134 TrapFrame : Ptr32 _KTRAP_FRAME)放入ebx
mov     [ebp+3Ch], ebx	;//(+0x03c Edx:Uint4B)=(+0x134 TrapFrame:Ptr32 _KTRAP_FRAME),暂时放一放
mov     [esi+134h], ebp	;//将_ktrap_Frame的地址放入_ETHREAD.TrapFrame,即当前线程的TrapFrame指向现在的TrapFrame.
cld	;//flag寄存器df位清零
mov     ebx, [ebp+60h]	;//将ebx=ebp3
mov     edi, [ebp+68h]	;//edi=eip3(返回地址)
mov     [ebp+0Ch], edx	;//_KTRAP_FRAME.DbgArgPointer = edx,之前的参数指针
mov     dword ptr [ebp+8], 0BADB0D00h	;//不用管
mov     [ebp+0], ebx	;//DbgEbp=ebp3
mov     [ebp+4], edi	;//DbgEip=eip3
test    byte ptr [esi+2Ch], 0FFh	;//_ETHREAD. _KTHREAD.DebugActive 判断是否处于调试模式
jnz     Dr_kss_a
loc_406841:
sti	;//允许中断
jmp     loc_406932
_KiSystemService endp
```

KiFastSystemCall()

```assembly
mov     ecx, 23h	;//00100 0 11,写入ds,es
push    30h
pop     fs	;//将fs设置为30和之前一样,fs = 00110 0 00,段选择子为5,加载段选择子,指向_KPCR结构体
mov     ds, ecx
mov     es, ecx
mov     ecx, large fs:40h	;//ecx=_KPCR.TSS
mov     esp, [ecx+4]	;//esp=_KTSS.Esp0
push    23h	;//ss3
push    edx	;//esp3
pushf	;//push eflag3
push    2
add     edx, 8	;//esp3+8,返回地址
popf	;//设置eflag0为2
or      [esp+0Ch+var_B], 2	;//或,
push    1Bh	;//cs3
push    dword ptr ds:0FFDF0304h	;//_KUSER_SHARED_DATA.SystemCallReturn,返回地址
push    0	;//errcode
push    ebp
push    ebx
push    esi
push    edi
mov     ebx, large fs:1Ch	;//_KPCR.SelfPcr,为_KPCR结构体自身地址,ebx=_KPCR
push    3Bh	;//fs3
mov     esi, [ebx+124h]	;//_KPCR._KPRCB.CurrentThread
push    dword ptr [ebx]	;//_KPCR._NT_TIB.ExceptionList
mov     dword ptr [ebx], 0FFFFFFFFh	;//设置为-1
mov     ebp, [esi+18h]	;//ebp=_ETHREAD._KTHREAD.InitialStack
push    1	;//_ktrap_Frame.PreviousPreviousMode,设置先前模式为1
sub     esp, 48h	;//提升栈顶,esp=_ktrap_Frame
sub     ebp, 29Ch	;//ebp=_ETHREAD._KTHREAD.InitialStack-0x29C
mov     byte ptr [esi+140h], 1	;//_ETHREAD._KTHREAD.PreviousMode=1
cmp     ebp, esp	;//比较ebp和esp.
jnz     loc_40686C
and     dword ptr [ebp+2Ch], 0	;//清空_ktrap_Frame.Dr7
test    byte ptr [esi+2Ch], 0FFh	;//_ETHREAD._KTHREAD.DebugActive是否为-1
mov     [esi+134h], ebp	;//_ETHREAD._KTHREAD.TrapFrame=ebp,当前线程的TrapFrame指向当前的TrapFrame
jnz     Dr_FastCallDrSave
loc_40691B:
mov     ebx, [ebp+60h]	;//ebx=ebp3
mov     edi, [ebp+68h]	;//edi=eip3(返回地址)
mov     [ebp+0Ch], edx	;//_ktrap_Frame.DbgArgPointer,写入之前的函数参数堆栈
mov     dword ptr [ebp+8], 0BADB0D00h	;//_ktrap_Frame.DbgArgMark=0BADB0D00h
mov     [ebp+0], ebx	;//DbgEbp=ebp3
mov     [ebp+4], edi	;//DbgEip=eip3(返回地址)
sti	;//设置允许中断
```

初始化工作完成,现在KiSystemService()和KiFastSystemCall()一样了

```assembly
loc_406932:
mov     edi, eax	;//edi=系统调用号
shr     edi, 8	;//系统调用号右移8位
and     edi, 30h	;//30,0011 0000,检测第12位是否为1,走ntoskrl.exe还是win32k.sys
mov     ecx, edi	;//ecx存储0x00或者0x10(调用号大于0x1000)
add     edi, [esi+0E0h]	;//_ETHREAD._KTHREAD.ServiceTable,edi现在存放着SSDT表的地址
mov     ebx, eax	;//ebx=系统调用号
and     eax, 0FFFh	;//系统调用号只要后12位
cmp     eax, [edi+8]	;//判断系统调用号是否在服务函数的个数里面
jnb     _KiBBTUnexpectedRange
cmp     ecx, 10h	;//与0x10比较,0x10(调用号大于0x1000)
jnz     short loc_406972
;如果调用号大于0x1000才执行下面的,先不看了
mov     ecx, large fs:18h
xor     ebx, ebx
...
loc_406972:
inc     large dword ptr fs:638h	;//_KPCR._KPRCB.KeSystemCalls+1
mov     esi, edx	;//esi=edx=函数参数指针
mov     ebx, [edi+0Ch]	;//edi=系统服务表,edi+0xch=参数个数表
xor     ecx, ecx	;//清零ecx
mov     cl, [eax+ebx]	;//cl=[参数个数表+系统调用号]=需要的参数总长度
mov     edi, [edi]	;//edi=系统服务表的函数地址表
mov     ebx, [edi+eax*4]	;//ebx=要调用的函数的地址
sub     esp, ecx	;//提升堆栈,提升高度为需要的参数总长度
shr     ecx, 2	;//参数总长度/4==参数的个数
mov     edi, esp	;//edi=函数参数堆栈地址
test    byte ptr [ebp+72h], 2	;//对比之前设置的eflag0是否还是为2,校验一下之前有没有跳转什么的.和海哥的内核有差异,但是问题不大.
jnz     short loc_40699B
test    byte ptr [ebp+6Ch], 1	;//判断cs3是否是3环的
jz      short _KiSystemServiceCopyArguments@0 ; KiSystemServiceCopyArguments()
;如果是3环就执行下面的
cmp     esi, ds:_MmUserProbeAddress	;//检查3环的参数地址范围有没有越界.即ring3,0x7FFFFFFF.
jnb     loc_406B4F
...
rep		movsd	;//开始复制参数了,(esi=函数参数指针)(edi=函数参数堆栈地址),将数据从ESI指向的内存位置复制到EDI指向的内存位置,复制ecx次.
call 	ebx	;//call	ebx=要调用的函数的地址
```

_ktrap_Frame

```
kd> dt _ktrap_Frame
nt!_KTRAP_FRAME
   +0x000 DbgEbp           : Uint4B
   +0x004 DbgEip           : Uint4B
   +0x008 DbgArgMark       : Uint4B
   +0x00c DbgArgPointer    : Uint4B
   +0x010 TempSegCs        : Uint4B
   +0x014 TempEsp          : Uint4B
   +0x018 Dr0              : Uint4B
   +0x01c Dr1              : Uint4B
   +0x020 Dr2              : Uint4B
   +0x024 Dr3              : Uint4B
   +0x028 Dr6              : Uint4B
   +0x02c Dr7              : Uint4B
   +0x030 SegGs            : Uint4B
   +0x034 SegEs            : Uint4B
   +0x038 SegDs            : Uint4B
   +0x03c Edx              : Uint4B
   +0x040 Ecx              : Uint4B
   +0x044 Eax              : Uint4B
   +0x048 PreviousPreviousMode : Uint4B	//push PreviousMode
   +0x04c ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD	//push ExceptionList
   +0x050 SegFs            : Uint4B	//push fs 保存一下寄存器的值
   +0x054 Edi              : Uint4B	//push edi
   +0x058 Esi              : Uint4B	//push esi
   +0x05c Ebx              : Uint4B	//push ebx
   +0x060 Ebp              : Uint4B	//push ebp
   +0x064 ErrCode          : Uint4B	//push 0,填充一下errcode
   +0x068 Eip              : Uint4B	//中断门提权压栈的几个寄存器
   +0x06c SegCs            : Uint4B
   +0x070 EFlags           : Uint4B
   +0x074 HardwareEsp      : Uint4B
   +0x078 HardwareSegSs    : Uint4B
   +0x07c V86Es            : Uint4B	//虚拟8086模式,现在不用
   +0x080 V86Ds            : Uint4B
   +0x084 V86Fs            : Uint4B
   +0x088 V86Gs            : Uint4B
```

```
mov     ebx, 30h ; '0'
mov     fs, ebx	//fs = 00110 0 00,段选择子为6,看一下这个表
```

![image-20230412155421485](./%E6%BB%B4%E6%B0%B4%E4%B8%89%E6%9C%9F%E4%B8%AD%E7%BA%A7%E7%AC%94%E8%AE%B0.assets/image-20230412155421485.png)

0xFFDFF000 Data RW Ac,指向_KPCR结构体.

_KPCR

```
kd> dt _KPCR 0xFFDFF000
nt!_KPCR
   +0x000 NtTib            : _NT_TIB	//又指向_NT_TIB结构体
   +0x01c SelfPcr          : 0xffdff000 _KPCR
   +0x020 Prcb             : 0xffdff120 _KPRCB
   +0x024 Irql             : 0 ''
   +0x028 IRR              : 0
   +0x02c IrrActive        : 0
   +0x030 IDR              : 0xffffffff
   +0x034 KdVersionBlock   : 0x8054e2b8 Void
   +0x038 IDT              : 0x8003f400 _KIDTENTRY
   +0x03c GDT              : 0x8003f000 _KGDTENTRY
   +0x040 TSS              : 0x80042000 _KTSS
   +0x044 MajorVersion     : 1
   +0x046 MinorVersion     : 1
   +0x048 SetMember        : 1
   +0x04c StallScaleFactor : 0x840
   +0x050 DebugActive      : 0 ''
   +0x051 Number           : 0 ''
   +0x052 Spare0           : 0 ''
   +0x053 SecondLevelCacheAssociativity : 0 ''
   +0x054 VdmAlert         : 0
   +0x058 KernelReserved   : [14] 0
   +0x090 SecondLevelCacheSize : 0
   +0x094 HalReserved      : [16] 0
   +0x0d4 InterruptMode    : 0
   +0x0d8 Spare1           : 0 ''
   +0x0dc KernelReserved2  : [17] 0
   +0x120 PrcbData         : _KPRCB
```

_NT_TIB

```
kd> dt _NT_TIB 0xFFDFF000
nt!_NT_TIB
   +0x000 ExceptionList    : 0x80551cb0 _EXCEPTION_REGISTRATION_RECORD
   +0x004 StackBase        : 0x805524f0 Void
   +0x008 StackLimit       : 0x8054f700 Void
   +0x00c SubSystemTib     : (null) 
   +0x010 FiberData        : (null) 
   +0x010 Version          : 0
   +0x014 ArbitraryUserPointer : (null) 
   +0x018 Self             : (null) 
```

_KPRCB

```
kd> dt _KPRCB 0xFFDFF120
nt!_KPRCB
   +0x000 MinorVersion     : 1
   +0x002 MajorVersion     : 1
   +0x004 CurrentThread    : 0x8055ce60 _KTHREAD
   +0x008 NextThread       : (null) 
   +0x00c IdleThread       : 0x8055ce60 _KTHREAD
   +0x010 Number           : 0 ''
   +0x011 Reserved         : 0 ''
   +0x012 BuildType        : 0
   +0x014 SetMember        : 1
   +0x018 CpuType          : 6 ''
   +0x019 CpuID            : 1 ''
   +0x01a CpuStep          : 0x9702
   +0x01c ProcessorState   : _KPROCESSOR_STATE
   +0x33c KernelReserved   : [16] 0
   +0x37c HalReserved      : [16] 0
   +0x3bc PrcbPad0         : [92]  ""
   +0x418 LockQueue        : [16] _KSPIN_LOCK_QUEUE
   +0x498 PrcbPad1         : [8]  ""
   +0x4a0 NpxThread        : (null) 
   +0x4a4 InterruptCount   : 0x1a56e
   +0x4a8 KernelTime       : 0xda40
   +0x4ac UserTime         : 0xe35
   +0x4b0 DpcTime          : 1
   +0x4b4 DebugDpcTime     : 0
   +0x4b8 InterruptTime    : 0x269
   +0x4bc AdjustDpcThreshold : 0x14
   +0x4c0 PageColor        : 0x7af7a
   +0x4c4 SkipTick         : 0
   +0x4c8 MultiThreadSetBusy : 0 ''
   +0x4c9 Spare2           : [3]  ""
   +0x4cc ParentNode       : 0x8055d560 _KNODE
   +0x4d0 MultiThreadProcessorSet : 1
   +0x4d4 MultiThreadSetMaster : 0xffdff120 _KPRCB
   +0x4d8 ThreadStartCount : [2] 0
   +0x4e0 CcFastReadNoWait : 0
   +0x4e4 CcFastReadWait   : 0xb5eb
   +0x4e8 CcFastReadNotPossible : 0
   +0x4ec CcCopyReadNoWait : 0x42
   +0x4f0 CcCopyReadWait   : 0xdc75
   +0x4f4 CcCopyReadNoWaitMiss : 0xe
   +0x4f8 KeAlignmentFixupCount : 0
   +0x4fc KeContextSwitches : 0x9e875
   +0x500 KeDcacheFlushCount : 0
   +0x504 KeExceptionDispatchCount : 0x2ffe
   +0x508 KeFirstLevelTbFills : 0
   +0x50c KeFloatingEmulationCount : 0
   +0x510 KeIcacheFlushCount : 0
   +0x514 KeSecondLevelTbFills : 0
   +0x518 KeSystemCalls    : 0x78893e
   +0x51c SpareCounter0    : [1] 0
   +0x520 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x5a0 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x6a0 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x7a0 PacketBarrier    : 0
   +0x7a4 ReverseStall     : 2
   +0x7a8 IpiFrame         : (null) 
   +0x7ac PrcbPad2         : [52]  ""
   +0x7e0 CurrentPacket    : [3] (null) 
   +0x7ec TargetSet        : 0
   +0x7f0 WorkerRoutine    : (null) 
   +0x7f4 IpiFrozen        : 0
   +0x7f8 PrcbPad3         : [40]  ""
   +0x820 RequestSummary   : 0
   +0x824 SignalDone       : (null) 
   +0x828 PrcbPad4         : [56]  ""
   +0x860 DpcListHead      : _LIST_ENTRY [ 0x8055d4c4 - 0x8055d4c4 ]
   +0x868 DpcStack         : 0xba4d0000 Void
   +0x86c DpcCount         : 0x8757
   +0x870 DpcQueueDepth    : 1
   +0x874 DpcRoutineActive : 0
   +0x878 DpcInterruptRequested : 0
   +0x87c DpcLastCount     : 0x8757
   +0x880 DpcRequestRate   : 0
   +0x884 MaximumDpcQueueDepth : 1
   +0x888 MinimumDpcRate   : 3
   +0x88c QuantumEnd       : 0
   +0x890 PrcbPad5         : [16]  ""
   +0x8a0 DpcLock          : 0
   +0x8a4 PrcbPad6         : [28]  ""
   +0x8c0 CallDpc          : _KDPC
   +0x8e0 ChainedInterruptList : (null) 
   +0x8e4 LookasideIrpFloat : 0n1487
   +0x8e8 SpareFields0     : [6] 0
   +0x900 VendorString     : [13]  "GenuineIntel"
   +0x90d InitialApicId    : 0 ''
   +0x90e LogicalProcessorsPerPhysicalProcessor : 0x1 ''
   +0x910 MHz              : 0x840
   +0x914 FeatureBits      : 0xa0013fff
   +0x918 UpdateSignature  : _LARGE_INTEGER 0x0000001e`00000000
   +0x920 NpxSaveArea      : _FX_SAVE_AREA
   +0xb30 PowerState       : _PROCESSOR_POWER_STATE
```

## 4.进程与线程

ring0查看自身eprocess

```c
#include <ntifs.h>

void UnloadDriver(PDRIVER_OBJECT driver);

NTSTATUS DriverEntry(PDRIVER_OBJECT driver, PUNICODE_STRING reg_path)
{
	PEPROCESS pEprocess = NULL;
	PCHAR ImageFileName;
	ULONG pid;
	__asm
	{
		mov eax, fs: [0x124] ;	//fs指向_KPCR,_KPCR[0x124]=_KTHREAD
		mov eax, [eax + 0x220];	//_KTHREAD=_ETHREAD,_ETHREAD[0x220]=_EPROCESS
		mov pEprocess, eax;
		mov eax, [eax + 0x84];	//_EPROCESS[0x84]=UniqueProcessId(pid),_EPROCESS[0x174]=ImageFileName.
		mov pid, eax;
	}
	ImageFileName = (PCHAR)pEprocess + 0x174;
	DbgPrint("pid: %x, ImageFileName:%s\n", pid, ImageFileName);
	driver->DriverUnload = UnloadDriver;
	return STATUS_SUCCESS;
}

void UnloadDriver(PDRIVER_OBJECT driver)
{
	DbgPrint("驱动停止了。\r\n");
}
```

 模拟Windows线程调度

ts.h

```c
#pragma once
// ThreadCore.h: interface for the ThreadCore class.
//
//////////////////////////////////////////////////////////////////////

